package com.example.homework2

object TeamRepository {
    val teams: List<Team> = listOf(
        Team(
            0,
            "Oracle Red Bull Racing",
            "Австрия",
            "Молодая и амбициозная команда, партнерство с Oracle Corporation приносит современные инновации в автоспорт.",
            "Oracle Red Bull Racing - это команда, которая не боится проводить эксперименты с технологиями и стремится создать инновационные решения для максимальной производительности на трассе. Партнерство с Oracle Corporation дает команде доступ к передовым разработкам в области искусственного интеллекта, облачных вычислений и аналитики данных, что помогает им оставаться на переднем крае технического прогресса в мире автоспорта.",
            "https://cdn.f1ne.ws/userfiles/RB20-2024.jpg"
        ),
        Team(
            1,
            "Mercedes AMG Petronas F1 Team",
            "Германия",
            "Лидер в мире Формулы 1, команда Mercedes AMG Petronas известна своими техническими ноу-хау и победами",
            "Mercedes AMG Petronas F1 Team - красавец технических инноваций в Формуле 1. Не только команда с многочисленными чемпионскими титулами, но и центральная фигура в разработке передовых технологий для максимальной эффективности и надежности болида. Их стратегия комбинирует интеллектуальные данные, инженерное мастерство и агрессивную стратегию гонок.",
            "https://cdn.f1ne.ws/userfiles/W15-2024.jpg"
        ),
        Team(
            2,
            "Scuderia Ferrari HP",
            "Италия",
            "Итальянский автогигант с богатым наследием и стойкими успехами в Формуле 1.",
            "Scuderia Ferrari HP - это более чем команда, это итальянский шедевр в мире автоспорта. В симбиозе мощи знаменитых красных болидов и страсти к победе, команда продолжает впереди гонки с передовыми разработками двигателя и аэродинамики, создавая легендарные истории в Формуле 1.",
            "https://cdn.f1ne.ws/userfiles/SF-24.jpg"
        ),
        Team(
            3,
            "Aston Martin Aramco F1 Team",
            "Великобритания",
            "Изысканный британский бренд вновь на трассе с партнерством с Aramco, стремясь к новым высотам во Формуле 1.",
            "Aston Martin Aramco F1 Team - это встреча традиций и современных инноваций в гоночном мире. Новый этап для бренда Aston Martin вражеская среда Формулы 1, обеспечивает платформу для совместной работы с техническим партнером Aramco и высокие стандарты в дизайне и инженерии, которые поддерживают легендарное наследие марки.",
            "https://cdn.f1ne.ws/userfiles/AMR24-1.jpg"
        ),
        Team(
            4,
            "BWT Alpine F1 Team",
            "Франция",
            "Комбинация австрийской инженерии и французского автоспорта, BWT Alpine F1 Team - лучший вариант для тех, кто любит новаторский подход.",
            "BWT Alpine F1 Team - это инженерное чудо, которое комбинирует техническую гармонию аустрийцев и французскую страсть к гонкам. Партнерство с Alpine и BWT позволяет команде разрабатывать уникальные решения в области аэродинамики, технических трансформаций и гончарных стратегий, внося инновации в мир Формулы 1",
            "https://cdn.f1ne.ws/userfiles/A524.jpg"
        ),
        Team(
            5,
            "McLaren F1 Team",
            "Германия",
            "Команда McLaren - культовая гоночная команда, с богатой историей и традициями в мире автоспорта. \n",
            "Команда McLaren знаменита своим стремлением к инновациям и техническому совершенству. Сочетание ведущей экспертизы в инженерии и инновационных подходов позволяет им создавать конкурентоспособные болиды и разработки в области аэродинамики, двигателей и технических решений. McLaren также известна своими успешными программами молодежного развития гонщиков, помогая выявлять и развивать талантливых гонщиков для будущего автоспорта. В целом, команда McLaren продолжает внедрять передовые технологии и оставаться на передовой в мире Формулы 1.",
            "https://cdn.f1ne.ws/userfiles/MCL38-2024.jpg"
        ),
        Team(
            6,
            "Williams Racing",
            "Великобритания",
            "Легендарная британская команда с глубокой историей и великолепными гонщиками.",
            "Williams Racing - это не только команда с впечатляющими достижениями в истории Формулы 1, но и легендарное наследие британского автоспорта. С богатым техническим опытом и контингентом талантливых гонщиков, команда стремится к восстановлению своего сопровождения на вершину пьедесталов чемпионатов.",
            "https://cdn.f1ne.ws/userfiles/FW46.jpg"
        ),Team(
            7,
            "Visa Cash App RB F1 Team",
            " Италия",
            "Инновационная команда с партнерством Visa Cash App, влияющая на будущее автоспорта.",
            "Visa Cash App RB F1 Team - визуализирует будущее автоспорта с прицелом на цифровые технологии и инновационные стратегии гонок. Партнерство с Visa Cash App открывает новые перспективы для создания уникальных решений в области финансов и спорта, отражая вдохновение на цифровую трансформацию в мире Формулы 1.",
            "https://cdn.f1ne.ws/userfiles/VCARB-01.jpg"
        )

    )
}